app/controllers/categories_controller.rb

SELECT * FROM `categories`
---
  def index
      begin
          @categories = Category.all

SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
---
  def edit
      begin
          @category = Category.find(params[:id])