app/controllers/clients_controller.rb

SELECT * FROM `clients`
---
  def index
    @clients = Client.paginate :page => params[:page], :order => 'name'

SELECT * FROM `clients` WHERE (`clients`.`id` = 1)
---
  def show
    @client = Client.find(params[:id])

SELECT * FROM `clients` WHERE (`clients`.`id` = 1)
---
  def edit
    @client = Client.find(params[:id])

INSERT INTO `clients` (`name`, `cif`, `address`, `created_at`, `notes`, `updated_at`, `mobile`, `fax`, `phone`, `website`, `email`) VALUES('El corte ingles', 'S27627276', '', '2010-10-23 19:44:59', '', '2010-10-23 19:44:59', '', '', '', '', '')
---
  def create
    @client = Client.new(params[:client])

    if @client.save

SELECT * FROM `clients` WHERE (`clients`.`id` = 1)
UPDATE `clients` SET `updated_at` = '2010-10-23 19:45:31', `address` = 'Blah', `fax` = '91.123.4568', `website` = 'http://corteingles.es' WHERE `id` = 1
---
  def update
    @client = Client.find(params[:id])

    if @client.update_attributes(params[:client])