app/controllers/employees_controller.rb

  def index
    begin
        @employees = Employee.paginate :page => params[:page], :order => 'last_name'
---
SELECT * FROM `employees`

  def show
    begin
        @employee = Employee.find(params[:id])
---
SELECT * FROM `employees` WHERE (`employees`.`id` = 2)

  def edit
    begin
        @employee = Employee.find(params[:id])
---
SELECT * FROM `employees` WHERE (`employees`.`id` = 2)

  def create
    begin
      if params[:commit] == "Cancel"
        redirect_to(@employee)
      else
        @employee = Employee.create_employee(params[:employee])
---
INSERT INTO `employees` (`nif`, `photo_file_size`, `created_at`, `reset_uuid`, `join_date`, `photo_file_name`, `updated_at`, `photo_content_type`, `mobile`, `category_id`, `last_name`, `phone`, `password`, `first_name`, `email`) VALUES('12345', NULL, '2010-10-23 19:46:56', NULL, '2010-10-23 00:00:00', NULL, '2010-10-23 19:46:56', NULL, '', 3, 'Doblado', '', '689287e1e9a726e00f6fc326774df2c0a6eb8232', 'Pedro', 'pedro@pedro.com')

  def update
    begin

      @employee = Employee.find(params[:id])

      if @employee.update_attributes(params[:employee])
---
SELECT * FROM `employees` WHERE (`employees`.`id` = 2)
UPDATE `employees` SET `updated_at` = '2010-10-23 19:47:05', `photo_file_name` = 'pedro_doblado.jpg', `photo_file_size` = 13510, `photo_content_type` = 'image/jpeg' WHERE `id` = 2