app/controllers/expensereports_controller.rb

  def index
    if params[:month] && params[:year]

      @expensereports_all = Expensereport.find_all_by_employee_id(session[:user_id], :include => :project)
      @projects = []
      for expense in @expensereports_all do
        unless @projects.include?(expense.project)
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)

  def show
    @expensereport = Expensereport.find(params[:id])
---
SELECT * FROM `expensereports` WHERE (`expensereports`.`id` = 1)

  def new
    # We get all the projects and jobs that belong to an employee
    @jobs = Job.find_all_by_employee_id(session[:user_id])
    @projects = Array.new
    @jobs.each do |job|
      if !@projects.include?(Project.find(job.project_id))
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)

  def edit
    if Expensereport.exists?(params[:id])
      @jobs = Job.find_all_by_employee_id(session[:user_id])
      @projects = Array.new
      @jobs.each do |job|
        if !@projects.include?(Project.find(job.project_id))
          @projects << Project.find(job.project_id)
        end
      end
      @expensereport = Expensereport.find(params[:id])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
SELECT * FROM `expensereports` WHERE (`expensereports`.`id` = 2)

  def create
    @expensereport = Expensereport.new(params[:expensereport])
    @expensereport.employee_id = session[:user_id]
    if @expensereport.save
---
INSERT INTO `expensereports` (`created_at`, `updated_at`, `project_id`, `amount`, `employee_id`, `expenseDate`, `job_id`) VALUES('2010-10-26 23:58:26', '2010-10-26 23:58:26', NULL, 200, NULL, '2010-10-26', NULL)

  def update
    @expensereport = Expensereport.find(params[:id])
    if @expensereport.update_attributes(params[:expensereport])
---
SELECT * FROM `expensereports` WHERE (`expensereports`.`id` = 2)
UPDATE `expensereports` SET `updated_at` = '2010-10-27 00:41:25', `job_id` = 2, `amount` = 2000 WHERE `id` = 2

  def destroy
    @expensereport = Expensereport.find(params[:id])
    @expensereport.destroy
---
SELECT * FROM `expensereports` WHERE (`expensereports`.`id` = 1)
DELETE FROM `expensereports` WHERE `id` = 1