app/controllers/expensereports_controller.rb

  def index
    @expensereports = Expensereport.all
---
SELECT * FROM `expensereports`