app/controllers/jobs_controller.rb

SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
SELECT * FROM `employees`
---
  def new
    begin
      @job = Job.new
      @project   = Project.find(params[:project_id])
      @employees = Employee.find(:all)
      @job.employee = current_user if @job.employee.blank?

SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
---
  def create
    if params[:commit] == "Cancel"
      redirect_to(@job.project)
    else
      @project = Project.find(params[:project_id])