app/controllers/projects_controller.rb

SELECT * FROM `statuses`
SELECT * FROM `projects` WHERE (`projects`.`status_id` = '1')
SELECT * FROM `statuses` WHERE (`statuses`.`id` = 1)
---
  def get_projects
      @status = Status.all
      if params[:id] == 0
          @projects = Project.all
      else
          @projects = Project.find_all_by_status_id(params[:id])
      end
      @status_name = Status.find(params[:id]).name

SELECT * FROM `projects` ORDER BY status_id ASC, name
---
  def index
    logger.error { "#{session.to_yaml}" }
    @status = Status.all
    @projects = Project.all (:order => "status_id ASC, name")