app/controllers/projects_controller.rb

  def index
    conds = []
    @status = Status.all

    if params[:client_id].to_i == 0 or params[:client_id] == blank?
      # client = ""
    else
      client = params[:client_id]
      @client = Client.find(client)
      conds << ["projects.client_id = ?", client]
    end
    if params[:status_id].to_i == 0 or params[:status_id] == blank?
      @status_name = "All"
      # status = ""
    else
      @status_name = Status.find(params[:status_id]).name
---
SELECT * FROM `statuses`
SELECT * FROM `clients` WHERE (`clients`.`id` = 1)
SELECT * FROM `statuses` WHERE (`statuses`.`id` = 1)

  def new
    begin
        @project  = Project.new
        @partners = Employee.get_partners
        @managers = Employee.get_managers
        @project.manager = current_user if @managers.include?(current_user)
        if permitted_to? :manage, :clients
          @clients  = Client.all
---
SELECT * FROM `employees` WHERE (category_id >2 and category_id<5)
SELECT * FROM `clients`

  def edit
    begin
      @project = Project.find(params[:id])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)

  def create
    begin
      @project = Project.create_project(params[:project])
      @project.status_id = 1 if @project.status_id.blank?
      if @project.save
        flash[:notice] = 'Project was successfully created.'
        redirect_to(projects_url)
      else
        @partners = Employee.get_partners
        @managers = Employee.get_managers
        @project.manager = current_user if @project.manager.blank? && @managers.include?(current_user)
        if permitted_to? :manage, :clients
          @clients  = Client.all
        else
          @clients = current_user.clients
        end
        @statuses = Status.find(:all)
---
INSERT INTO `projects` (`name`, `created_at`, `updated_at`, `manager_id`, `client_id`, `description`, `status_id`, `partner_id`) VALUES('Project 1', '2010-10-23 19:49:24', '2010-10-23 19:49:24', 2, 1, 'We need to blah We need to blah We need to blah We need to blah We need to blah We need to blah We need to blah We need to blah We need to blah We need to blah We need to blah We need to blah We need to blah ', 1, 3)
SELECT * FROM `statuses` WHERE (`statuses`.`id` = 1)

  def update
    begin
      @project = Project.find(params[:id])
      if @project.has_pending_jobs? and params[:project][:status_id].to_i == 3
        flash[:error] = 'To close a Project you must first finish all its jobs'
        render :action => "edit"
      else
        if @project.update_attributes(params[:project])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
UPDATE `projects` SET `updated_at` = '2010-10-24 14:24:02', `date_end` = '2011-10-24', `date_start` = '2010-10-24' WHERE `id` = 1