app/controllers/site_controller.rb

  def login
      @title = 'Employee Login'
      begin
          # If user is LOGGED IN already
          if request.get? and session[:user_id]
              redirect_to :controller => 'intranet', :action => 'index'
          end

          # If user submit data, and data is correct
          if request.post? and params[:user] and !params[:user].empty?
              email          = params[:user][:email]
              encrypted_pwd  = Digest::SHA1.hexdigest("#{email}|#{params[:user][:password]}")
              if encrypted_pwd == Employee.password_from_mail(email)
                  user = Employee.find_by_email(email)
---
SELECT * FROM `employees` WHERE (`employees`.`email` = 'fer@wadomo.com') LIMIT 1